session3/cours/java-maven-deps.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-04 Wed 01:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gestion de dépendances avec Maven</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="bernard" />
</head>
<body>
<div id="content">
<h1 class="title">Gestion de dépendances avec Maven</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org009d503">1. Maven pour la gestion de dépendances</a></li>
<li><a href="#org492a592">2. En pratique</a>
<ul>
<li><a href="#orgaf8242a">2.1. Création du projet Maven</a></li>
<li><a href="#orga1e1958">2.2. Ajout d'une dépendance</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org009d503" class="outline-2">
<h2 id="org009d503"><span class="section-number-2">1</span> Maven pour la gestion de dépendances</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://fr.wikipedia.org/wiki/Apache_Maven">Maven</a> est un outils de construction (<i>build</i>) de projets java. Il
permet de gérer notamment, mais pas seulement, les dépendances
(i.e. bibliothèques) en téléchargeant automatiquement celles-ci et en
gérant le <code>CLASSPATH</code> pour que celles-ci soient directement
utilisables.
</p>

<p>
La configuration de Maven est gérée par un fichier au format XML : <code>pom.xml</code>.
</p>

<p>
Les dépendances sont indiquées dans un bloc <code>dependencies</code> :
</p>
<div class="org-src-container">
<pre class="src src-nxml">&lt;<span style="color: #000088; background-color: #DEDEDE;">dependencies</span>&gt;

    <span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">les d&#233;pendances sont indiqu&#233;es ici </span><span style="color: #8D8D84;">--&gt;</span>

&lt;/<span style="color: #000088; background-color: #DEDEDE;">dependencies</span>&gt;

</pre>
</div>

<p>
Chaque dépendance est indiquée dans un bloc <code>dependency</code> :
</p>
<div class="org-src-container">
<pre class="src src-nxml">    &lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;

    <span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">la d&#233;pendance est indiqu&#233;e ici </span><span style="color: #8D8D84;">--&gt;</span>

    &lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
</pre>
</div>

<p>
Les informations caractérisant la dépendance sont :
</p>
<dl class="org-dl">
<dt>groupId</dt><dd>identifie l'organisme qui publie la bibliothèque.</dd>
<dt>artifactId</dt><dd>identifie la bibliothèque parmi celle publiées par
l'organisme.</dd>
<dt>version</dt><dd>indique la version de la bibliothèque à utiliser.</dd>
</dl>
</div>
</div>


<div id="outline-container-org492a592" class="outline-2">
<h2 id="org492a592"><span class="section-number-2">2</span> En pratique</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgaf8242a" class="outline-3">
<h3 id="orgaf8242a"><span class="section-number-3">2.1</span> Création du projet Maven</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Sous l'environnement de développement (e.g. Eclipse ou IntelliJ), lors
de la création du projet, choisir un projet Maven. Par exemple sous
IntelliJ <code>File</code> &rarr; <code>New</code> &rarr; <code>Project…</code>, choisir
<code>Maven</code> dans la marge de gauche.
</p>

<p>
Dans un premier temps, on ne choisira pas d'archetype. Le projet maven
a alors un <code>GroupId</code>, un <code>ArtifactId</code> et une version, comme les
dépendances. Par défaut, l'<code>ArtifactId</code> est le nom du projet.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Créer un projet maven appelé <code>TestMavenCsv</code> (Choisir
<code>Enable Auto-Import</code> lorsque cela est proposé).</dd>
</dl>
</div>
</div>


<div id="outline-container-orga1e1958" class="outline-3">
<h3 id="orga1e1958"><span class="section-number-3">2.2</span> Ajout d'une dépendance</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Dans le fichier <code>pom.xml</code>, ajouter un bloc <code class="src src-nxml">&lt;<span style="color: #000088; background-color: #DEDEDE;">dependencies</span>&gt; &lt;/<span style="color: #000088; background-color: #DEDEDE;">dependencies</span>&gt;</code>.
</p>

<p>
Ensuite, on va chercher les informations pour indiquer une dépendance
envers une bibliothèque d'utilisation de fichiers au format csv,
<a href="http://commons.apache.org/proper/commons-csv/">Apache Common CSV</a>. Il suffit de <a href="https://mvnrepository.com/search?q=apache+common+csv">chercher sur le site mvnrepository.com</a>
pour trouver <a href="https://mvnrepository.com/artifact/org.apache.commons/commons-csv">la page avec les informations nécessaires</a> :
</p>

<div class="org-src-container">
<pre class="src src-nxml"><span style="color: #8D8D84;">&lt;!-- </span><span style="color: #8D8D84; font-style: italic;">https://mvnrepository.com/artifact/org.apache.commons/commons-csv </span><span style="color: #8D8D84;">--&gt;</span>
&lt;<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;org.apache.commons&lt;/<span style="color: #000088; background-color: #DEDEDE;">groupId</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;commons-csv&lt;/<span style="color: #000088; background-color: #DEDEDE;">artifactId</span>&gt;
    &lt;<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;1.7&lt;/<span style="color: #000088; background-color: #DEDEDE;">version</span>&gt;
&lt;/<span style="color: #000088; background-color: #DEDEDE;">dependency</span>&gt;
</pre>
</div>

<p>
On peut ensuite écrire le code suivant :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">import</span> <span style="color: #D0372D;">org</span>.<span style="color: #D0372D;">apache</span>.<span style="color: #D0372D;">commons</span>.<span style="color: #D0372D;">csv</span>.<span style="color: #6434A3;">CSVFormat</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">org</span>.<span style="color: #D0372D;">apache</span>.<span style="color: #D0372D;">commons</span>.<span style="color: #D0372D;">csv</span>.<span style="color: #6434A3;">CSVPrinter</span>;

<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">FileWriter</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">IOException</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">HashMap</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Map</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Main</span> {
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">HEADERS</span> = {<span style="color: #008000;">"nom_commune"</span>, <span style="color: #008000;">"latitude"</span>, <span style="color: #008000;">"longitude"</span>};
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">double</span>[]&gt; <span style="color: #BA36A5;">nameToCoords</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">double</span>[]&gt;();

    <span style="color: #0000FF;">static</span> {
        nameToCoords.put(<span style="color: #008000;">"Attignat"</span>, <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">double</span>[]{46.283333, 5.166667});
        nameToCoords.put(<span style="color: #008000;">"Beaupont"</span>, <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">double</span>[]{46.4, 5.266667});
        nameToCoords.put(<span style="color: #008000;">"B&#233;ny"</span>, <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">double</span>[]{46.333333, 5.283333});
    }

    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">IOException</span> {
        <span style="color: #6434A3;">FileWriter</span> <span style="color: #BA36A5;">out</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">FileWriter</span>(<span style="color: #008000;">"communes_new.csv"</span>);
        <span style="color: #0000FF;">try</span> (<span style="color: #6434A3;">CSVPrinter</span> <span style="color: #BA36A5;">printer</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">CSVPrinter</span>(out, <span style="color: #D0372D;">CSVFormat</span>.DEFAULT
                .withHeader(HEADERS))) {
            <span style="color: #0000FF;">for</span> (<span style="color: #D0372D;">Map</span>.<span style="color: #6434A3;">Entry</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">double</span>[]&gt; <span style="color: #006699;">city</span> : nameToCoords.entrySet()) {
                <span style="color: #6434A3;">double</span>[] <span style="color: #BA36A5;">coords</span> = city.getValue();
                printer.printRecord(city.getKey(), coords[0], coords[1]);
            }
        }
    }
}
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">org</span>.<span style="color: #D0372D;">apache</span>.<span style="color: #D0372D;">commons</span>.<span style="color: #D0372D;">csv</span>.<span style="color: #6434A3;">CSVFormat</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">org</span>.<span style="color: #D0372D;">apache</span>.<span style="color: #D0372D;">commons</span>.<span style="color: #D0372D;">csv</span>.<span style="color: #6434A3;">CSVPrinter</span>;

<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">FileWriter</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">IOException</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">HashMap</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Map</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Main</span> {
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">HEADERS</span> = {<span style="color: #008000;">"nom_commune"</span>, <span style="color: #008000;">"latitude"</span>, <span style="color: #008000;">"longitude"</span>};
    <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">Map</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">double</span>[]&gt; <span style="color: #BA36A5;">nameToCoords</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">HashMap</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">double</span>[]&gt;();

    <span style="color: #0000FF;">static</span> {
        nameToCoords.put(<span style="color: #008000;">"Attignat"</span>, <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">double</span>[]{46.283333, 5.166667});
        nameToCoords.put(<span style="color: #008000;">"Beaupont"</span>, <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">double</span>[]{46.4, 5.266667});
        nameToCoords.put(<span style="color: #008000;">"B&#233;ny"</span>, <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">double</span>[]{46.333333, 5.283333});
    }

    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">IOException</span> {
        <span style="color: #6434A3;">FileWriter</span> <span style="color: #BA36A5;">out</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">FileWriter</span>(<span style="color: #008000;">"communes_new.csv"</span>);
        <span style="color: #0000FF;">try</span> (<span style="color: #6434A3;">CSVPrinter</span> <span style="color: #BA36A5;">printer</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">CSVPrinter</span>(out, <span style="color: #D0372D;">CSVFormat</span>.DEFAULT
                .withDelimiter(<span style="color: #008000;">';'</span>).withHeader(HEADERS))) {
            <span style="color: #0000FF;">for</span> (<span style="color: #D0372D;">Map</span>.<span style="color: #6434A3;">Entry</span>&lt;<span style="color: #6434A3;">String</span>, <span style="color: #6434A3;">double</span>[]&gt; <span style="color: #006699;">city</span> : nameToCoords.entrySet()) {
                <span style="color: #6434A3;">double</span>[] <span style="color: #BA36A5;">coords</span> = city.getValue();
                printer.printRecord(city.getKey(), coords[0], coords[1]);
            }
        }
    }
}

</pre>
</div>

<p>
Attention ! :: IntelliJ <a href="https://youtrack.jetbrains.com/issue/IDEA-222668">oblige à modifier la configuration pour que le programme puisse s'exécuter</a>. (<code>File</code> &rarr; <code>Settings…</code> &rarr; <code>Build, Execution, Deployment</code> &rarr; <code>Compiler</code> &rarr; <code>Java Compiler</code> &rarr; <code>Per-module bytecode version</code> , mettre le <code>Target bytecode version</code> à 1.8 au moins).
</p>


<p>
Le programme peut être compilé et exécuté, Maven gérant automatiquement la dépendance à la bibliothèque <code>Apache Commons CSV</code>.
</p>


<dl class="org-dl">
<dt>Exercice</dt><dd>Compiler et exécuter le code.</dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: bernard</p>
<p class="date">Created: 2019-12-04 Wed 01:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
